# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageTypeSet..::..Contains Method
VoltageTypeSet Class See Also
---
Tests for the existence of a voltage type within the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	VoltageType item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As VoltageType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	VoltageType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..VoltageTypeThe voltage type to be searched for.
# ### Return Value
The Contains method returns True if the voltage type is within the set, otherwise False.
# See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace